examples_2D_Simulations/2D_RM6_noPTO_floating/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

nNodes  4;
cpuPN   36;

numberOfSubdomains #eval { $nNodes*$cpuPN };
method          hierarchical;
coeffs
{
    n           ($numberOfSubdomains 1 1);
}


// ************************************************************************* //
